app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "gh"], ["room_number", -1], ["created_at", "2021-02-21 00:15:30.365727"], ["updated_at", "2021-02-21 00:15:30.365727"]]
---
    def create
        # byebug
        # puts params.inspect
        @school_class = SchoolClass.create(school_classes_params(:title, :room_number))